{"class_name": "Sequential", "config": {"name": "sequential_5", "layers": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_constraint": null, "name": "conv2d_5", "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "batch_input_shape": [null, 120, 160, 3], "strides": [1, 1], "activation": "relu", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 32, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [3, 3], "name": "max_pooling2d_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_5", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_regularizer": null, "trainable": true, "units": 32, "name": "dense_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_regularizer": null, "trainable": true, "units": 64, "name": "dense_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_regularizer": null, "trainable": true, "units": 4, "name": "dense_15", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.2.3"}